suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
#include "MqttHandler.h"
#include "PeerHandler.h"
#include "WebHandler.h"
#include "EspNowHandler.h"
#include "version.h"
#include "HaDiscovery.h"
#include "WebLog.h"
#include <ESP8266WiFi.h>
#include <ESP8266httpUpdate.h>

// Global variables definition
bool mqttConnected = false;
unsigned long lastMqttReconnectAttempt = 0;
const unsigned long MQTT_RECONNECT_INTERVAL = 5000;

// External globals
extern const char* BUILD_DATE;
extern const char* BUILD_TIME;
extern DomoticaEspNow espNow;

// Define wifiClient and mqttClient
WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);

// --- GESTIONE MQTT --- //
void onMqttConnect() {
    mqttConnected = true;
    
    DevLog.println("✅ MQTT: Connected Callback Triggered");
    
    // Sottoscrivi ai 4 topic richiesti
    String gatewayCommandTopic = String(mqtt_topic_prefix) + "/gateway/command";
    String nodeCommandTopic = String(mqtt_topic_prefix) + "/nodo/command";
    
    DevLog.printf("📡 Subscribing to: %s\n", gatewayCommandTopic.c_str());
    if (mqttClient.subscribe(gatewayCommandTopic.c_str())) {
        DevLog.println("   -> Subscription SUCCESS");
    } else {
        DevLog.println("   -> Subscription FAILED");
    }
    
    DevLog.printf("📡 Subscribing to: %s\n", nodeCommandTopic.c_str());
    if (mqttClient.subscribe(nodeCommandTopic.c_str())) {
        DevLog.println("   -> Subscription SUCCESS");
    } else {
        DevLog.println("   -> Subscription FAILED");
    }

    // NEW: Subscribe to Dashboard Status for Auto-Discovery
    String dashboardStatusTopic = String(mqtt_topic_prefix) + "/dashboard/status";
    DevLog.printf("📡 Subscribing to: %s\n", dashboardStatusTopic.c_str());
    mqttClient.subscribe(dashboardStatusTopic.c_str());

    // NEW: Send Discovery Request to force Dashboard to announce itself
    String dashboardDiscoveryTopic = String(mqtt_topic_prefix) + "/dashboard/discovery";
    mqttClient.publish(dashboardDiscoveryTopic.c_str(), "{\"command\":\"DISCOVER\"}");
    DevLog.printf("📡 Sent Dashboard Discovery Request to: %s\n", dashboardDiscoveryTopic.c_str());

    delay(200); // Small delay to ensure stability before sending heartbeat

    // NEW: Send Gateway Heartbeat immediately to announce version and status
    sendGatewayHeartbeat();

    // Pubblica discovery per tutti i peer conosciuti
    for (int i = 0; i < peerCount; i++) {
        // 1. Configurazione Home Assistant
        HaDiscovery::publishDiscovery(mqttClient, peerList[i], mqtt_topic_prefix);
        HaDiscovery::publishDashboardConfig(mqttClient, peerList[i], mqtt_topic_prefix);
        
        // 2. Forza Availability ONLINE (Fondamentale al riavvio)
        String availTopic = String(mqtt_topic_prefix) + "/nodo/" + String(peerList[i].nodeId) + "/availability";
        mqttClient.publish(availTopic.c_str(), "online", true);

        // 3. Pubblica stato attuale
        publishPeerStatus(i, "HEARTBEAT"); 
        
        // Piccolo delay per evitare buffer overflow durante l'invio massivo
        delay(50);
    }
}

void onMqttDisconnect() {
    mqttConnected = false;
}

// Callback per messaggi MQTT ricevuti
void onMqttMessage(char* topic, byte* payload, unsigned int length) {
    // Converte payload in stringa in modo efficiente per evitare frammentazione
    String message;
    if (length > 0) {
        message.reserve(length);
        for (unsigned int i = 0; i < length; i++) {
            message += (char)payload[i];
        }
    }
    
    String topicStr = String(topic);
    String gatewayCommandTopic = String(mqtt_topic_prefix) + "/gateway/command";
    String nodeCommandTopic = String(mqtt_topic_prefix) + "/nodo/command";
    String dashboardStatusTopic = String(mqtt_topic_prefix) + "/dashboard/status";
    
    if (topicStr == gatewayCommandTopic) {
        processMqttCommand(message);
    } else if (topicStr == nodeCommandTopic) {
        processNodeCommand(message);
    } else if (topicStr == dashboardStatusTopic) {
        // Handle Dashboard Discovery & Status
        DynamicJsonDocument doc(512);
        DeserializationError error = deserializeJson(doc, message);
        if (!error) {
            if (doc.containsKey("status") && doc["status"] == "offline") {
                 discoveredDashboardIP = ""; // Clear IP to signal offline
                 DevLog.println("🖥️ Dashboard went OFFLINE (LWT)");
            } else if (doc.containsKey("ip")) {
                discoveredDashboardIP = doc["ip"].as<String>();
                lastDashboardSeen = millis();
                DevLog.printf("🖥️ Dashboard rilevata: %s\n", discoveredDashboardIP.c_str());
            }
        }
    }
}

// --- FUNZIONI MQTT DI BASE --- //
// Funzione per pubblicare stato del gateway: domoriky/gateway/status
void publishGatewayStatus(const String& eventType, const String& message, const String& command, const String& ip) {
    if (!mqttClient.connected()) {
        return;
    }
    
    // Topic unico per status del gateway: domoriky/gateway/status
    String topic = String(mqtt_topic_prefix) + "/gateway/status";
    
    // Crea il payload JSON
    DynamicJsonDocument doc(512);
    doc["eventType"] = eventType;
    doc["gatewayId"] = gateway_id;
    doc["message"] = message;
    doc["timestamp"] = millis();
    doc["MAC"] = WiFi.macAddress(); // Aggiungi MAC address del gateway
    doc["version"] = FIRMWARE_VERSION;
    doc["buildDate"] = String(BUILD_DATE) + " " + String(BUILD_TIME);
    
    // Aggiungi il campo command se specificato
    if (command.length() > 0) {
        doc["command"] = command;
    }
    
    // Aggiungi IP se specificato
    if (ip.length() > 0) {
        doc["ip"] = ip;
    }
    
    // Safety check: ensure gatewayId is never null or empty
    if (!doc["gatewayId"] || String(gateway_id).length() == 0 || String(gateway_id) == "null") {
        doc["gatewayId"] = "GATEWAY_02"; // Fallback to default
    }
    
    String payload;
    serializeJson(doc, payload);
    
    // Pubblica sul topic
    mqttClient.publish(topic.c_str(), payload.c_str());
}

// Funzione per pubblicare dati nodi: domoriky/nodo/status
void publishNodeStatus(const String& nodeId, const String& topic_name, const String& command, const String& status, const String& type) {
    if (!mqttClient.connected()) {
        return;
    }
    
    // Topic unico per status dei nodi: domoriky/nodo/status
    String topic = String(mqtt_topic_prefix) + "/nodo/status";
    
    // Crea il payload JSON
    DynamicJsonDocument doc(512);
    doc["Node"] = nodeId;
    doc["Topic"] = topic_name;
    doc["Command"] = command;
    doc["Status"] = status;
    doc["Type"] = type;
    doc["gatewayId"] = gateway_id;
    doc["timestamp"] = millis();
    
