suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
    // Aggiungi MAC address del nodo se disponibile
    for (int i = 0; i < peerCount; i++) {
        if (String(peerList[i].nodeId) == nodeId) {
            char macStr[18];
            snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
                    peerList[i].mac[0], peerList[i].mac[1], peerList[i].mac[2],
                    peerList[i].mac[3], peerList[i].mac[4], peerList[i].mac[5]);
            doc["MAC"] = macStr;
            
            // Include current attributes state for value_template
            if (strlen(peerList[i].attributes) > 0) {
                doc["attributes"] = peerList[i].attributes;
            }
            
            break;
        }
    }
    
    String payload;
    serializeJson(doc, payload);
    
    // Pubblica sul topic
    mqttClient.publish(topic.c_str(), payload.c_str());
}

void publishNodeAvailability(const String& nodeId, const char* availability) {
    if (!mqttClient.connected()) {
        return;
    }
    String topic = String(mqtt_topic_prefix) + String("/nodo/") + nodeId + String("/availability");
    mqttClient.publish(topic.c_str(), availability, true);
}

void publishToMQTT(const String& subtopic, const String& eventType, const String& message) {
    // Reindirizza alla nuova funzione gateway
    publishGatewayStatus(eventType, message);
}

bool connectToMQTT() {
    if (mqttConnected) {
        return true;
    }
    
    mqttClient.setServer(mqtt_server, mqtt_port);
    mqttClient.setCallback(onMqttMessage);
    mqttClient.setKeepAlive(30);
    mqttClient.setSocketTimeout(5);
    
    String clientId = "ESP8266Gateway_" + String(gateway_id);
    String willTopic = String(mqtt_topic_prefix) + String("/gateway/availability");
    const char* willMsg = "offline";
    
    bool connected = false;
    
    DevLog.print("🔌 Tentativo connessione MQTT a ");
    DevLog.print(mqtt_server);
    DevLog.print(":");
    DevLog.println(mqtt_port);
    
    if (strlen(mqtt_user) > 0 && strlen(mqtt_password) > 0) {
        DevLog.println("   Uso autenticazione user/pass");
        connected = mqttClient.connect(clientId.c_str(), mqtt_user, mqtt_password,
                                      willTopic.c_str(), 0, true, willMsg);
    } else {
        DevLog.println("   Connessione anonima");
        connected = mqttClient.connect(clientId.c_str(), willTopic.c_str(), 0, true, willMsg);
    }
    
    if (connected) {
        DevLog.println("✅ MQTT Connesso!");
        // Birth message per availability gateway
        mqttClient.publish(willTopic.c_str(), "online", true);
        onMqttConnect();
        return true;
    } else {
        DevLog.print("❌ MQTT Errore connessione. Stato: ");
        DevLog.println(mqttClient.state());
        // Stati PubSubClient:
        // -4 : MQTT_CONNECTION_TIMEOUT
        // -3 : MQTT_CONNECTION_LOST
        // -2 : MQTT_CONNECT_FAILED
        // -1 : MQTT_DISCONNECTED
        // 1 : MQTT_CONNECTED
        // 2 : MQTT_CONNECT_BAD_PROTOCOL
        // 3 : MQTT_CONNECT_BAD_CLIENT_ID
        // 4 : MQTT_CONNECT_UNAVAILABLE
        // 5 : MQTT_CONNECT_BAD_CREDENTIALS
        // 6 : MQTT_CONNECT_UNAUTHORIZED
        return false;
    }
}

void reconnectMQTT() {
    unsigned long currentTime = millis();
    
    if (mqttConnected || (currentTime - lastMqttReconnectAttempt < MQTT_RECONNECT_INTERVAL)) {
        return;
    }
    
    lastMqttReconnectAttempt = currentTime;
    // Ri-crea il client WiFi per resilienza
    wifiClient.stop();
    delay(50);
    connectToMQTT();
}

void setupMQTT() {
    // IMPORTANTE: setBufferSize DEVE essere chiamato PRIMA di setServer
    mqttClient.setBufferSize(MQTT_MAX_PACKET_SIZE);
    mqttClient.setKeepAlive(30); // seconds
    mqttClient.setSocketTimeout(5); // seconds
    mqttClient.setServer(mqtt_server, mqtt_port);
    mqttClient.setCallback(onMqttMessage);
}

void publishPeerStatus(int i, const char* command) {
    if (!mqttClient.connected()) return;
    
    unsigned long currentTime = millis();
    DynamicJsonDocument peerDoc(512);
    peerDoc["command"] = command;
    
    // Safety check for gatewayId
    if (String(gateway_id).length() == 0 || String(gateway_id) == "null") {
        peerDoc["gatewayId"] = "GATEWAY_02"; // Fallback
    } else {
        peerDoc["gatewayId"] = gateway_id;
    }
    
    peerDoc["timestamp"] = currentTime;
    peerDoc["index"] = i;
    peerDoc["totalNodes"] = peerCount;
    
    // Calcola nodi online per allineamento con PING_NETWORK_REPORT
    int onlineNodes = 0;
    for(int j=0; j<peerCount; j++) {
        if(peerList[j].isOnline) onlineNodes++;
    }
    peerDoc["onlineNodes"] = onlineNodes;
    
    char macStr[18];
    snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X",
             peerList[i].mac[0], peerList[i].mac[1], peerList[i].mac[2], 
             peerList[i].mac[3], peerList[i].mac[4], peerList[i].mac[5]);
    
    peerDoc["mac"] = macStr;
    peerDoc["nodeId"] = strlen(peerList[i].nodeId) > 0 ? peerList[i].nodeId : macStr;
    
    // --- HA COMPATIBILITY FIELDS ---
    // HaDiscovery expects "Node" (PascalCase) matching nodeId
    peerDoc["Node"] = peerDoc["nodeId"]; 
    // -------------------------------

    peerDoc["nodeType"] = strlen(peerList[i].nodeType) > 0 ? peerList[i].nodeType : "UNKNOWN";
    peerDoc["firmwareVersion"] = strlen(peerList[i].firmwareVersion) > 0 ? peerList[i].firmwareVersion : "UNKNOWN";
    peerDoc["attributes"] = strlen(peerList[i].attributes) > 0 ? peerList[i].attributes : "";
    peerDoc["status"] = peerList[i].isOnline ? "online" : "offline";
    
    // Aggiungi informazioni aggiuntive se disponibili
    if (peerList[i].lastSeen > 0) {
        unsigned long lastSeenAgo = currentTime - peerList[i].lastSeen;
        peerDoc["lastSeenMs"] = lastSeenAgo;
        peerDoc["lastSeen"] = String(lastSeenAgo / 1000) + "s fa";
    } else {
         peerDoc["lastSeenMs"] = -1;
         peerDoc["lastSeen"] = "MAI";
    }

    String peerResponse;
    serializeJson(peerDoc, peerResponse);
    
