suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
    // Comandi per il GATEWAY - Struttura: {"command": "PING_NETWORK"}
    String command = "";
    if (doc.containsKey("command")) {
        command = doc["command"].as<String>();
    } else if (doc.containsKey("Command")) {
        command = doc["Command"].as<String>();
    }
    
    if (command.length() > 0) {
        
        DevLog.printf("Comando per GATEWAY - Command: %s\n", command.c_str());

        // Comando OTA_UPDATE
        if (command == "OTA_UPDATE") {
            DevLog.println("--- COMMAND: OTA_UPDATE RECEIVED ---");
            
            // Verifica che il comando sia per questo gateway specifico
            if (doc.containsKey("gatewayId")) {
                String targetId = doc["gatewayId"].as<String>();
                DevLog.printf("Target Gateway ID: %s (My ID: %s)\n", targetId.c_str(), gateway_id);
                
                if (targetId != String(gateway_id)) {
                    DevLog.println("Ignored: Command not for me.");
                    return; 
                }
            } else {
                DevLog.println("Warning: No gatewayId in command, proceeding anyway (broadcast?)");
            }

            if (doc.containsKey("url")) {
                String url = doc["url"].as<String>();
                performOTA(url);
            } else {
                DevLog.println("Error: Missing URL");
                publishGatewayStatus("error", "Missing URL for OTA_UPDATE", "OTA_UPDATE");
            }
            return;
        }

        // Comando GET_VERSION
        if (command == "GET_VERSION") {
            String message = "Version: " + String(FIRMWARE_VERSION) + ", Build: " + String(BUILD_DATE) + " " + String(BUILD_TIME);
            publishGatewayStatus("version_info", message, "GET_VERSION");
            return;
        }
        
        // Comando LIST_PEERS
        if (command == "LIST_PEERS") {
            listPeers();
            return;
        }

        // Comando RESET_WIFI_CONFIG
        if (command == "RESET_WIFI_CONFIG") {
            DevLog.println("Comando RESET_WIFI_CONFIG ricevuto via MQTT. Eseguo reset WiFi...");
            publishGatewayStatus("wifi_reset", "Resetting WiFi configuration and rebooting...", "RESET_WIFI_CONFIG");
            // Piccolo delay per permettere l'invio del messaggio MQTT
            delay(1000);
            resetWiFiConfig();
            return;
        }
        

        // Comando GATEWAY_HEARTBEAT
        if (command == "GATEWAY_HEARTBEAT") {
            sendGatewayHeartbeat();
            return;
        }
        
        // NOTA: Il comando NODE_REBOOT è ora gestito nella funzione processNodeCommand
        // per essere inviato al topic corretto: domoriky/nodo/command
        
        // Comando NODE_FACTORY_RESET - Factory reset di un nodo specifico
        if (command == "NODE_FACTORY_RESET") {
            if (doc.containsKey("nodeId")) {
                String targetNodeId = doc["nodeId"].as<String>();
                
                // Cerca il nodo nella lista dei peer
                bool nodeFound = false;
                for (int i = 0; i < peerCount; i++) {
                    if (String(peerList[i].nodeId) == targetNodeId) {
                        // Invia comando FACTORY_RESET al nodo specifico
                        espNow.send(peerList[i].mac, peerList[i].nodeId, "CONTROL", "FACTORY_RESET", "", "COMMAND", gateway_id);
                        
                        // Invia conferma via WebSocket (o MQTT se necessario)
                        // In questo caso loggiamo solo
                        DevLog.printf("Factory reset sent to node %s\n", targetNodeId.c_str());
                        
                        nodeFound = true;
                        break;
                    }
                }
                
                if (!nodeFound) {
                    // Nodo non trovato nella lista peer - nessun messaggio MQTT
                }
            } else {
                // Parametro nodeId mancante - nessun messaggio MQTT
            }
            commandHandled = true;
            return;
        }
        
        // Comando NETWORK_REBOOT - Riavvia tutti i nodi nella rete
        if (command == "NETWORK_REBOOT") {
            DynamicJsonDocument responseDoc(512);
            responseDoc["command"] = "NETWORK_REBOOT";
            responseDoc["timestamp"] = millis();
            responseDoc["total_nodes"] = peerCount;
            
            if (peerCount > 0) {
                JsonArray rebootedNodes = responseDoc.createNestedArray("rebooted_nodes");
                int nodesSent = 0;
                
                // Invia comando RESTART individualmente a ciascun nodo (come sequenza di NODE_REBOOT)
                for (int i = 0; i < peerCount; i++) {
                    if (peerList[i].isOnline) {
                        // Invia comando RESTART al nodo specifico (come NODE_REBOOT)
                        espNow.send(peerList[i].mac, peerList[i].nodeId, "CONTROL", "RESTART", "REQUEST", "COMMAND", gateway_id);
                        
                        // Aggiungi il nodo alla lista dei nodi riavviati
                        rebootedNodes.add(peerList[i].nodeId);
                        nodesSent++;
                        
                        // Piccolo delay tra un invio e l'altro
                        delay(50);
                    }
                }
                
                responseDoc["nodes_sent"] = nodesSent;
                
                DevLog.printf("Network Reboot initiated: %d nodes targeted\n", nodesSent);
            } else {
                responseDoc["error"] = "No peers found";
                DevLog.println("Network Reboot failed: No peers");
            }
            
            commandHandled = true;
            return;
        }
        
        // Comando REMOVE_PEER con formato JSON
        if (command == "REMOVE_PEER") {
            if (doc.containsKey("gatewayId")) {
                String requestedGatewayId = doc["gatewayId"];
                if (requestedGatewayId == gateway_id) {
                    if (doc.containsKey("mac")) {
                        String macAddress = doc["mac"];
                        removePeer(macAddress.c_str());
                    } else {
                        publishGatewayStatus("missing_parameter", "MAC address required for REMOVE_PEER command", "REMOVE_PEER");
                    }
                }
            }
            commandHandled = true;
            return;
        }
        
