suppaman80/Domoriky_Esp_System/ESP8266_Gateway_mqtt/MqttHandler.cpp
        // Comando CLEAR_PEERS con formato JSON
        if (command == "CLEAR_PEERS") {
            if (doc.containsKey("gatewayId")) {
                String requestedGatewayId = doc["gatewayId"];
                if (requestedGatewayId == gateway_id) {
                    clearAllPeers();
                }
                // Se gatewayId diverso, ignora silenziosamente
            } else {
                // Parametro gatewayId mancante - nessun messaggio MQTT
            }
            commandHandled = true;
            return;
        }
        
        // Comando RESET_TO_AP con formato JSON
        if (command == "RESET_TO_AP") {
            resetWiFiConfig();
            commandHandled = true;
            return;
        }
        
        // Comando CLEANUP_OFFLINE_PEERS - Rimuove tutti i peer offline
        if (command == "CLEANUP_OFFLINE_PEERS") {
            DevLog.println("RICEVUTO - Comando: CLEANUP_OFFLINE_PEERS");
            
            int offlineCount = 0;
            int totalCount = peerCount;
            
            // Conta i peer offline e crea lista temporanea
            for (int i = 0; i < peerCount; i++) {
                if (!peerList[i].isOnline) {
                    offlineCount++;
                }
            }
            
            if (offlineCount > 0) {
                DevLog.print("Trovati ");
                DevLog.print(offlineCount);
                DevLog.println(" peer offline da rimuovere");
                
                // Rimuove i peer offline spostando i peer online all'inizio
                int newPeerCount = 0;
                for (int i = 0; i < peerCount; i++) {
                    if (peerList[i].isOnline) {
                        // Copia peer online nella nuova posizione
                        if (i != newPeerCount) {
                            memcpy(&peerList[newPeerCount], &peerList[i], sizeof(Peer));
                        }
                        newPeerCount++;
                    } else {
                        // Log rimozione peer offline
                        DevLog.print("Rimosso peer offline: ");
                        DevLog.println(peerList[i].nodeId);
                    }
                }
                
                peerCount = newPeerCount;
                
                // Salva la lista aggiornata
                savePeersToLittleFS();
                
                DevLog.print("Cleanup completato: rimossi ");
                DevLog.print(offlineCount);
                DevLog.print(" peer, rimasti ");
                DevLog.println(peerCount);
                
            } else {
                // Nessun peer offline da rimuovere
                DevLog.println("Nessun peer offline da rimuovere");
            }
            
            commandHandled = true;
            return;
        }
        
        // Comando RESTART con formato JSON
        if (command == "RESTART") {
            DevLog.println("RICEVUTO - Comando: RESTART");
            
            // Verifica gatewayId se specificato
            if (doc.containsKey("gatewayId")) {
                String targetGatewayId = doc["gatewayId"].as<String>();
                if (targetGatewayId != String(gateway_id)) {
                    return; // Ignora silenziosamente se gatewayId diverso
                }
            }
            
            // Disconnetti MQTT
            mqttClient.disconnect();
            mqttConnected = false;
            
            DevLog.println("Restarting ESP8266...");
            delay(1000);
            
            // Riavvia l'ESP8266 senza resettare la configurazione
            ESP.restart();
            commandHandled = true;
            return;
        }
        
        // Comando NETWORK_DISCOVERY / DISCOVERY con formato JSON
        if (command == "NETWORK_DISCOVERY" || command == "DISCOVERY") {
            DevLog.println("RICEVUTO - Comando: DISCOVERY / NETWORK_DISCOVERY");
            triggerGlobalDiscovery();
            commandHandled = true;
            return;
        }
        
        // Comando PING_NETWORK - Invia PING individualmente a tutti i nodi online
        if (command == "PING_NETWORK") {
            DevLog.println("RICEVUTO - Comando: PING_NETWORK");
            
            int nodesSent = 0;
            String pingedNodesStr = "[";
            
            if (peerCount > 0) {
                // Resetta lo stato delle risposte
                memset(pingResponseReceived, 0, sizeof(pingResponseReceived));
                
                // Invia comando PING individualmente a TUTTI i nodi nella lista
                for (int i = 0; i < peerCount; i++) {
                    // Salva il MAC del nodo pingato usando l'indice corretto
                    memcpy(pingedNodesMac[i], peerList[i].mac, 6);
                    pingResponseReceived[i] = false;
                    
                    // Invia comando PING al nodo specifico
                    espNow.send(peerList[i].mac, peerList[i].nodeId, "CONTROL", "PING", "REQUEST", "COMMAND", gateway_id);
                    
                    // Aggiungi ID nodo alla lista stringa (più leggero di JSON object completo)
                    if (nodesSent > 0) pingedNodesStr += ",";
                    pingedNodesStr += "\"" + String(peerList[i].nodeId) + "\"";
                    
                    nodesSent++;
                    
                    // Piccolo delay tra un invio e l'altro per evitare sovraccarico
                    delay(10);
                }
                
                // Avvia il processo di attesa risposte
                pingNetworkActive = true;
                pingNetworkStartTime = millis();
                pingResponseCount = peerCount; 
            }
            pingedNodesStr += "]";
            
            // Costruisci JSON manualmente per risparmiare RAM (evita DynamicJsonDocument 2KB)
            String responseOutput = "{";
            responseOutput += "\"command\":\"PING_NETWORK\",";
            responseOutput += "\"timestamp\":" + String(millis()) + ",";
            responseOutput += "\"total_nodes\":" + String(peerCount) + ",";
            responseOutput += "\"nodes_sent\":" + String(nodesSent) + ",";
            responseOutput += "\"result\":\"" + String(nodesSent > 0 ? "success" : "no_nodes") + "\",";
            responseOutput += "\"pinged_nodes\":" + pingedNodesStr;
            responseOutput += "}";
            
            // Pubblica report iniziale
            String topic = String(mqtt_topic_prefix) + "/gateway/status";
            mqttClient.publish(topic.c_str(), responseOutput.c_str());
            
            commandHandled = true;
            return;
        }
    }
}
